
# თხოვს მომხმარებელს მონაცემების შეყვანას
full_name = input("enter your full name: ")
age = input("enter your age: ")

# შევინახოთ მომხმარებლის მიერ შეყვანილი ინფორმაცია ცვლადებში
name = "data"
last_name = "manjgaladze"
age = 16



# (სტანდარტი 1) ცვლადების სახელდება 
# Python-ში მიღებულია snake_case სტილი (ყველა ასო პატარა, სიტყვები გამოყოფილი უნდა იყოს ქვედა ხაზით).
# მაგალითად: first_name, last_name, user_age. სახელი უნდა იყოს აღწერითი.

# (სტანდარტი 2) მონაცემთა ტიპების კონვერტაცია 
#  როდესაც ვიცით, რომ შემოტანილი მნიშვნელობა უნდა იყოს რიცხვი, აუცილებელია 
#  მისი ტიპის შეცვლა 


# (სტანდარტი 4) კოდის წაკითხვადობა და სტრუქტურა:
# -ლოგიკური ბლოკების გამოყოფა ცარიელი ხაზებით და გასაგები კომენტარებით
#   აკმაყოფილებს სუფთა კოდის  პრინციპებს.